codebase/projects/web/test/src/resources/edu/duke/cabig/c3pr/webservice/integration/testdata/UpdateSubjectRegistry.xml

<!--
  Copyright Duke Comprehensive Cancer Center and SemanticBits
   
     Distributed under the OSI-approved BSD 3-Clause License.
     See  https://github.com/NCIP/c3pr/LICENSE.txt for details.
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	 xmlns:uri="uri:iso.org:21090">
	<soapenv:Header>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1"><Assertion xmlns="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:samlp="urn:oasis:names:tc:SAML:1.0:protocol" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" AssertionID="_84a2dba9583195eb43fab0d3abf3f356" IssueInstant="2010-08-09T19:36:59.319Z" Issuer="dkrylov" MajorVersion="1" MinorVersion="1"><AuthenticationStatement AuthenticationInstant="2010-08-09T19:36:59.319Z" AuthenticationMethod="urn:oasis:names:tc:SAML:1.0:am:password"><Subject><NameIdentifier NameQualifier="c3pr">jdoe01</NameIdentifier><SubjectConfirmation><ConfirmationMethod>urn:oasis:names:tc:SAML:1.0:cm:holder-of-key</ConfirmationMethod><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:X509Data>
<ds:X509Certificate>
MIIDBjCCAsMCBExgWAQwCwYHKoZIzjgEAwUAMGgxDDAKBgNVBAYTA1VTQTELMAkGA1UECBMCVkEx
EDAOBgNVBAcTB0hlcm5kb24xETAPBgNVBAoTCHNlbWFudGljMQ8wDQYDVQQLEwZDb2RpbmcxFTAT
BgNVBAMTDERlbmlzIEtyeWxvdjAeFw0xMDA4MDkxOTMzMjRaFw0xMDExMDcxOTMzMjRaMGgxDDAK
BgNVBAYTA1VTQTELMAkGA1UECBMCVkExEDAOBgNVBAcTB0hlcm5kb24xETAPBgNVBAoTCHNlbWFu
dGljMQ8wDQYDVQQLEwZDb2RpbmcxFTATBgNVBAMTDERlbmlzIEtyeWxvdjCCAbgwggEsBgcqhkjO
OAQBMIIBHwKBgQD9f1OBHXUSKVLfSpwu7OTn9hG3UjzvRADDHj+AtlEmaUVdQCJR+1k9jVj6v8X1
ujD2y5tVbNeBO4AdNG/yZmC3a5lQpaSfn+gEexAiwk+7qdf+t8Yb+DtX58aophUPBPuD9tPFHsMC
NVQTWhaRMvZ1864rYdcq7/IiAxmd0UgBxwIVAJdgUI8VIwvMspK5gqLrhAvwWBz1AoGBAPfhoIXW
mz3ey7yrXDa4V7l5lK+7+jrqgvlXTAs9B4JnUVlXjrrUWU/mcQcQgYC0SRZxI+hMKBYTt88JMozI
puE8FnqLVHyNKOCjrh4rs6Z1kW6jfwv6ITVi8ftiegEkO8yk8b6oUZCJqIPf4VrlnwaSi2ZegHtV
JWQBTDv+z0kqA4GFAAKBgQDHeWl2X3DU7++f2MUfUKKSd6IAfkMd8/3r4tg5n12BhnqmnIiBX0rE
p47Nsn6bFK4kEEhXggb62Tm+XamuoTocvXRFwFKzJxVDi3O7Qgy1a8gutLSkPtwnoVos2gnoJULX
isk/G8q0fkLHnfrcmPKRh4MHvKQwSGxlMXGJzgW9tDALBgcqhkjOOAQDBQADMAAwLQIUF83BLhDU
gjRXybQuhiDEp9baBjMCFQCBuvPoXWRi3wgYshBzxI0ebaLMiQ==
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo></SubjectConfirmation></Subject></AuthenticationStatement><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#dsa-sha1" />
<ds:Reference URI="#_84a2dba9583195eb43fab0d3abf3f356">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature" />
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="code ds kind rw saml samlp typens #default xsd xsi" /></ds:Transform>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
<ds:DigestValue>nyKQmWEfKc+aQnOVfcMeJQOFfI8=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>W5MR1Ia4NUFS1nibEgruQPrDQYRpQlAv7sU+R/a0kR79157nGb1L9Q==</ds:SignatureValue>
<ds:KeyInfo>
<ds:X509Data>
<ds:X509Certificate>
MIIDBjCCAsMCBExgWAQwCwYHKoZIzjgEAwUAMGgxDDAKBgNVBAYTA1VTQTELMAkGA1UECBMCVkEx
EDAOBgNVBAcTB0hlcm5kb24xETAPBgNVBAoTCHNlbWFudGljMQ8wDQYDVQQLEwZDb2RpbmcxFTAT
BgNVBAMTDERlbmlzIEtyeWxvdjAeFw0xMDA4MDkxOTMzMjRaFw0xMDExMDcxOTMzMjRaMGgxDDAK
BgNVBAYTA1VTQTELMAkGA1UECBMCVkExEDAOBgNVBAcTB0hlcm5kb24xETAPBgNVBAoTCHNlbWFu
dGljMQ8wDQYDVQQLEwZDb2RpbmcxFTATBgNVBAMTDERlbmlzIEtyeWxvdjCCAbgwggEsBgcqhkjO
OAQBMIIBHwKBgQD9f1OBHXUSKVLfSpwu7OTn9hG3UjzvRADDHj+AtlEmaUVdQCJR+1k9jVj6v8X1
ujD2y5tVbNeBO4AdNG/yZmC3a5lQpaSfn+gEexAiwk+7qdf+t8Yb+DtX58aophUPBPuD9tPFHsMC
NVQTWhaRMvZ1864rYdcq7/IiAxmd0UgBxwIVAJdgUI8VIwvMspK5gqLrhAvwWBz1AoGBAPfhoIXW
mz3ey7yrXDa4V7l5lK+7+jrqgvlXTAs9B4JnUVlXjrrUWU/mcQcQgYC0SRZxI+hMKBYTt88JMozI
puE8FnqLVHyNKOCjrh4rs6Z1kW6jfwv6ITVi8ftiegEkO8yk8b6oUZCJqIPf4VrlnwaSi2ZegHtV
JWQBTDv+z0kqA4GFAAKBgQDHeWl2X3DU7++f2MUfUKKSd6IAfkMd8/3r4tg5n12BhnqmnIiBX0rE
p47Nsn6bFK4kEEhXggb62Tm+XamuoTocvXRFwFKzJxVDi3O7Qgy1a8gutLSkPtwnoVos2gnoJULX
isk/G8q0fkLHnfrcmPKRh4MHvKQwSGxlMXGJzgW9tDALBgcqhkjOOAQDBQADMAAwLQIUF83BLhDU
gjRXybQuhiDEp9baBjMCFQCBuvPoXWRi3wgYshBzxI0ebaLMiQ==
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo></ds:Signature></Assertion></wsse:Security>
	</soapenv:Header>
	<soapenv:Body>
        <ns4:UpdateSubjectRegistryRequest xmlns:ns5="http://enterpriseservices.nci.nih.gov" xmlns:ns4="http://enterpriseservices.nci.nih.gov/SubjectRegistryService" xmlns:ns3="http://enterpriseservices.nci.nih.gov/SubjectRegistry" xmlns:ns2="uri:iso.org:21090">
            <studySubject>
                <ns3:entity xsi:type="ns3:Person" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                    <ns3:administrativeGenderCode code="Female"/>
                    <ns3:birthDate value="19700102000000"/>
                    <ns3:biologicEntityIdentifier>
                        <ns3:effectiveDateRange nullFlavor="NI"/>
                        <ns3:identifier extension="345ER67"/>
                        <ns3:primaryIndicator value="true"/>
                        <ns3:typeCode code="MRN"/>
                        <ns3:assigningOrganization>
                            <ns3:organizationIdentifier>
                                <ns3:identifier extension="NC010"/>
                                <ns3:primaryIndicator value="true"/>
                                <ns3:typeCode code="CTEP"/>
                            </ns3:organizationIdentifier>
                        </ns3:assigningOrganization>
                    </ns3:biologicEntityIdentifier>
                    <ns3:ethnicGroupCode>
                        <ns2:item code="Not Reported"/>
                    </ns3:ethnicGroupCode>
                    <ns3:maritalStatusCode nullFlavor="NI"/>
                    <ns3:name>
                        <ns2:item>
                            <ns2:part type="GIV" value="Rupert"/>
                            <ns2:part type="FAM" value="Dean"/>
                        </ns2:item>
                    </ns3:name>
                    <ns3:postalAddress>
                        <ns2:item nullFlavor="NI"/>
                    </ns3:postalAddress>
                    <ns3:raceCode>
                        <ns2:item code="White"/>
                    </ns3:raceCode>
                    <ns3:telecomAddress/>
                </ns3:entity>
                <ns3:subjectIdentifier>
                    <ns3:identifier extension="service1"/>
                    <ns3:primaryIndicator value="true"/>
                    <ns3:typeCode code="COORDINATING_CENTER_ASSIGNED_STUDY_SUBJECT_IDENTIFIER"/>
                    <ns3:assigningOrganization>
                        <ns3:organizationIdentifier>
                            <ns3:identifier extension="NC010"/>
                            <ns3:primaryIndicator value="true"/>
                            <ns3:typeCode code="CTEP"/>
                        </ns3:organizationIdentifier>
                    </ns3:assigningOrganization>
                </ns3:subjectIdentifier>
                <ns3:paymentMethodCode code="private insurance"/>
                <ns3:statusCode code="Incomplete"/>
                <ns3:studySubjectProtocolVersion>
                    <ns3:studySiteProtocolVersion>
                        <ns3:studySite>
                            <ns3:organization>
                                <ns3:organizationIdentifier>
                                    <ns3:identifier extension="NC010"/>
                                    <ns3:primaryIndicator value="true"/>
                                    <ns3:typeCode code="CTEP"/>
                                </ns3:organizationIdentifier>
                            </ns3:organization>
                        </ns3:studySite>
                        <ns3:studyProtocolVersion>
                            <ns3:studyProtocolDocument>
                                <ns3:officialTitle value="Test Kruttik Wess Pankaj"/>
                                <ns3:document>
                                    <ns3:documentIdentifier>
                                        <ns3:identifier extension="TestKruttikWessPankaj"/>
                                        <ns3:primaryIndicator value="true"/>
                                        <ns3:typeCode code="COORDINATING_CENTER_IDENTIFIER"/>
                                        <ns3:assigningOrganization>
                                            <ns3:organizationIdentifier>
                                                <ns3:identifier extension="NC010"/>
                                                <ns3:primaryIndicator value="true"/>
                                                <ns3:typeCode code="CTEP"/>
                                            </ns3:organizationIdentifier>
                                        </ns3:assigningOrganization>
                                    </ns3:documentIdentifier>
                                </ns3:document>
                                <ns3:publicTitle value="test"/>
                                <ns3:publicDescription value=""/>
                            </ns3:studyProtocolDocument>
                        </ns3:studyProtocolVersion>
                    </ns3:studySiteProtocolVersion>
                    <ns3:studySubjectConsentVersion>
                        <ns3:informedConsentDate value="20100201000000"/>
                        <ns3:consent>
                            <ns3:officialTitle value="General"/>
                            <ns3:versionNumberText/>
                        </ns3:consent>
                        <ns3:consentDeliveryDate value="20090301000000"/>
                        <ns3:consentingMethod code="Written"/>
                        <ns3:consentPresenter value="Johnny Doe"/>
                    </ns3:studySubjectConsentVersion>
                    <ns3:studySubjectConsentVersion>
                        <ns3:informedConsentDate value="20080101000000"/>
                        <ns3:consent>
                            <ns3:officialTitle value="Male"/>
                            <ns3:versionNumberText/>
                        </ns3:consent>
                        <ns3:consentDeliveryDate value="20070101000000"/>
                        <ns3:consentingMethod code="Verbal"/>
                        <ns3:consentPresenter value="Deepa Singh"/>
                    </ns3:studySubjectConsentVersion>
                </ns3:studySubjectProtocolVersion>
            </studySubject>
        </ns4:UpdateSubjectRegistryRequest>
	</soapenv:Body>
</soapenv:Envelope>
